.cf.xml/Catalogs/обм_ПакетыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>обм_ПакетыДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.обм_ВходящиеСообщения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_категория</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_ид</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные_sha256</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.общ_sha256</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные_Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

.cf.xml/Catalogs/обм_ВходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>обм_ВходящиеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>HTTPМетод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтносительныйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникПараметра</Name>
							<Type>
								<v8:Type>cfg:EnumRef.обм_ВходящиеСообщения_ИсточникиПараметров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

.cf.xml/Catalogs/обм_ПакетыДанных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьОбъект(пВходящееСообщениеВладелец, пУзел, пКатегория, пИдентификатор) Экспорт
	
	общ.Проверка_Тип(пВходящееСообщениеВладелец, Тип("СправочникСсылка.обм_ВходящиеСообщения"));
	
	Если ПустаяСтрока(пУзел) Тогда
		ВызватьИсключение "Не заполнен параметр 'узел'";
		
	КонецЕсли;
	
	Если ПустаяСтрока(пУзел) Тогда
		ВызватьИсключение "Не заполнен параметр 'категория'";
		
	КонецЕсли;
	
	Если ПустаяСтрока(пИдентификатор) Тогда
		ВызватьИсключение "Не заполнен параметр 'идентификатор'";
		
	КонецЕсли;
	
	запрос = Новый Запрос;
	запрос.УстановитьПараметр("пВходящееСообщениеВладелец", пВходящееСообщениеВладелец);
	запрос.УстановитьПараметр("Узел", пУзел);
	запрос.УстановитьПараметр("Категория", пКатегория);
	запрос.УстановитьПараметр("Идентификатор", пИдентификатор);
	запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПакетыДанных.Ссылка КАК ПакетДанных,
	|	ВходящиеСообщения.ДатаВремя КАК ДатаВремя
	|ИЗ
	|	Справочник.обм_ПакетыДанных КАК ПакетыДанных,
	|	Справочник.обм_ВходящиеСообщения КАК ВходящиеСообщения
	|ГДЕ
	|	ПакетыДанных.Владелец = &пВходящееСообщениеВладелец
	|	И ПакетыДанных.Узел = &Узел
	|	И ПакетыДанных.Категория = &Категория
	|	И ПакетыДанных.Идентификатор = &Идентификатор
	|	И ВходящиеСообщения.Ссылка = &пВходящееСообщениеВладелец";
	
	выборка = запрос.Выполнить().Выбрать();
	
	пакетДанныхОбъект = Неопределено;
	выборка.Следующий();
	
	Если выборка.ПакетДанных = Null Тогда 
		пакетДанныхОбъект = Справочники.обм_ПакетыДанных.СоздатьЭлемент();
		
	Иначе
		пакетДанныхОбъект = выборка.ПакетДанных.ПолучитьОбъект();
		
	КонецЕсли; 
	
	пакетДанныхОбъект.Владелец = пВходящееСообщениеВладелец;
	пакетДанныхОбъект.ДатаВремя = выборка.ДатаВремя;
	пакетДанныхОбъект.ПометкаУдаления = Ложь;
	пакетДанныхОбъект.Узел = пУзел;
	пакетДанныхОбъект.Категория = пКатегория;
	пакетДанныхОбъект.Идентификатор = пИдентификатор;
	пакетДанныхОбъект.Данные = Неопределено; 
	
	Возврат пакетДанныхОбъект;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли // #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
